
N = int(input())
M = int(input())

field =[
    ['W','.','.','.','.','.','.','.','.','W','W','.'],
    ['.','W','.','.','.','.','.','.','.','W','W','W'],
    ['.','W','W','W','.','.','.','.','.','W','W','.'],
    ['.','.','.','.','.','.','.','.','.','.','W','.'],
    ['.','.','.','.','.','.','.','.','.','W','.','W'],
    ['.','.','W','.','.','.','.','.','.','.','W','.'],
    ['.','W','.','W','.','.','.','.','.','.','W','.'],
    ['W','.','W','.','W','.','.','.','.','.','W','W'],
    ['.','W','.','W','.','.','.','.','.','.','.','W'],
    ['.','.','W','.','.','.','.','.','.','.','.','W']
    ]
#水たまりの数
count = 0

#dfs内で隣接する(8近傍)Wをすべてけす(.にする)⇒dfsを最初に呼び出した数がみずたまりの数となる。
#現在位置(x,y)
def dfs(x,y):
    #現在位置を.に置き換える
    field[x][y] = '.'

    #移動する8方向をループ(-1,0,1)
    for dx in range(-1,2):
        for dy in range(-1,2):
            #x方向にdx,y方向にdy移動した先を nx,nyとする。
            nx = x + dx
            ny = y + dy
            #nxとnyの値が範囲内かの判定とfield[nx][ny]が水たまりかどうかの判定
            if (0 <= nx and nx < N) and (0 <= ny and ny < M) and (field[nx][ny] == 'W'):
                dfs(nx,ny)

for i in range(N):
    for j in range(M):
        if field[i][j] == 'W':
            dfs(i,j)
            count += 1

print(count)
